app/controllers/contact_forms_controller.rb

  def create
    @contact_form = ContactForm.new(contact_form_params)

    respond_to do |format|
      if @contact_form.save
---
INSERT INTO "contact_forms" ("created_at", "message", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 08 Apr 2016 20:37:59 UTC +00:00], ["message", "MyText"], ["updated_at", Fri, 08 Apr 2016 20:37:59 UTC +00:00]]