app/controllers/records_controller.rb

  def show
    @record_id = params[:id]
    @current_page = params[:page].to_i

    # run the where clause globally
    @relevant_record = Record.find(@record_id)
---
SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @record = Record.find(params[:id])
---
SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    # retrieve the current cas user name from the session hash
    @form_params = record_params()
    @form_params[:cas_user_name] = session[:cas_user]
    @record = Record.create( @form_params )
---
INSERT INTO "records" ("cas_user_name", "created_at", "metadata", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cas_user_name", "homer"], ["created_at", Sun, 03 Apr 2016 00:34:42 UTC +00:00], ["metadata", "MyString"], ["title", "MyString"], ["updated_at", Sun, 03 Apr 2016 00:34:42 UTC +00:00]]

    def set_record
      begin
        found_record = Record.find(params[:id])
---
SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", "980190962"]]